# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [3]:
import numpy as np
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[np.nan,120,340,124,243,np.nan]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    NaN
1    GOOG  Charlie  120.0
2    MSFT      Amy  340.0
3    MSFT  Vanessa  124.0
4      FB     Carl  243.0
5      FB    Sarah    NaN

**Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [6]:
df.groupby('Company')

In [7]:
by_company = df.groupby('Company')

In [8]:
by_company #Notice this crates an object

In [9]:
by_company.count()

         Person  Sales
Company
FB            2      1
GOOG          2      1
MSFT          2      2

**one usefull feature is the describe combine with the group by**

In [11]:
by_company.describe().transpose()

Company         FB   GOOG        MSFT
Sales count    1.0    1.0    2.000000
      mean   243.0  120.0  232.000000
      std      NaN    NaN  152.735065
      min    243.0  120.0  124.000000
      25%    243.0  120.0  178.000000
      50%    243.0  120.0  232.000000
      75%    243.0  120.0  286.000000
      max    243.0  120.0  340.000000

**Using aggragate funtions**

In [19]:
agg_funcs_over = {'Company':['count', 'sum', 'min', 'max']}

In [26]:
df[['Company','Sales']].groupby(['Company']).agg(agg_funcs_over)

        Company
          count       sum   min   max
Company
FB            2      FBFB    FB    FB
GOOG          2  GOOGGOOG  GOOG  GOOG
MSFT          2  MSFTMSFT  MSFT  MSFT